w6/d3/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!" #this results in DoubleRenderError
    render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tipper4"], ["email", "tipper4@email.com"], ["created_at", "2021-10-06 23:24:12.091634"], ["updated_at", "2021-10-06 23:24:12.091634"]]
---
  def create
    user = User.new(user_params)
    if user.save #adding ! here will stop executing the code here, resulting in erorr msg in preview

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    # debugger
    user = User.find_by(id: params[:id]) #find_by will return nil if nothing found

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    user = User.find_by(id: params[:id]).delete

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Tipper88"], ["email", "new_og_tipper6@email.edu"], ["updated_at", "2021-10-07 00:23:40.177091"], ["id", 8]]
---
  def update
    if user = User.find_by(id: params[:id])
      user.update(user_params)