w12/d2/benchbnb/app/controllers/api/users_controller.rb

  def show
    @user = User.find(params:[id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]