w7/d2/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    #below line is for the error b/c above line saves it already
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "2saIDSbMPOA4MN1JV8U-yA"], ["updated_at", "2021-10-12 21:02:46.758322"], ["id", 5]]