w7/d2/music_app/app/views/albums/new.html.erb

  <select name="album[band_id]" id="band">
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"