w6/d4/art_share_api/app/controllers/artwork_shares_controller.rb

  def create
    artworkshare = ArtworkShare.create(artworkshare_params)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 2], ["created_at", "2021-10-07 22:19:13.399548"], ["updated_at", "2021-10-07 22:19:13.399548"]]

  def destroy
    artworkshare = ArtworkShare.find(params[:id])
    artworkshare.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 9]]