w6/d4/art_share_api/app/controllers/artworks_controller.rb

  def index
    # if params[:user_id]
      arts_created = Artwork.where(artist_id: params[:user_id])
      arts_created ||= []
    # else
      arts_shared = Artwork.select("artworks.*").joins(:artwork_shares).where(artwork_shares:{viewer_id: params[:user_id]})
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 2]]
SELECT artworks.* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 3]]

  def create
    art = Artwork.create(artwork_params)
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mona Lisa"], ["image_url", "www.monalisa.com"], ["artist_id", 3], ["created_at", "2021-10-07 21:53:09.528034"], ["updated_at", "2021-10-07 21:53:09.528034"]]

  def show
    art = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def destroy
    art = Artwork.find(params[:id])
    art.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]

  def update
    art = Artwork.find(params[:id])
    if art
      art.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "fake_Tower"], ["updated_at", "2021-10-07 21:50:50.170436"], ["id", 1]]