w6/d4/art_share_api/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save #adding ! here will stop executing the code here, resulting in erorr msg in preview
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "tester"], ["created_at", "2021-10-07 21:20:19.461625"], ["updated_at", "2021-10-07 21:20:19.461625"]]

  def show
    # debugger
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    if user = User.find_by(id: params[:id])
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "New_Viewer_1"], ["updated_at", "2021-10-07 21:32:52.216188"], ["id", 4]]