w7/d2/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test1"], ["year", 2000], ["band_id", 2], ["live", true], ["created_at", "2021-10-13 00:12:10.268304"], ["updated_at", "2021-10-13 00:12:10.268304"]]